---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.OptionConflictInLinkBoundariesVaryMainSeparate
source: html/e735d3ab-75ef-c51f-81be-6cac90ef1c26.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.OptionConflictInLinkBoundariesVaryMainSeparate Property

Option conflict between rooms in the Revit link '[Link Instance Name]'.\nThe room boundary in the main model of the Revit link differs from the apparent boundary in the linked view '[View Name from Link]'.\nTo resolve the issue, open the Revit link file for editing, and use room separation lines to divide the space in the main model.

## Syntax (C#)
```csharp
public static FailureDefinitionId OptionConflictInLinkBoundariesVaryMainSeparate { get; }
```